THIS_FILE_WAS_PROTECTED_WITH_py0x1_ဍလပဤအဤ="""

    ╔════════════╗
 ╔══║ py0x1 @1.0 ║
 ║  ╚════════════╝
 ╚═ [
 GEN  py0x1_66647074666d767a7666
 TIME  2024-06-22 20:12:11.189549
 VERSION  1.0
 STATE  MAX_PROTECTION
 ]

 """

ဪဍဩဘဟလဘဤလ=chr
လပအအလဘဋဪပ=ord
ဪဪဪအဘဩ=str

class x7ဩဋ100811:
    def _0x103109(self):
       assert 0x104416, 'ဋဘလဟအဋဩဍဋဋဟဩဘဪလအဘ'
        
    
def ဪဘဪပလဍဩပဍဘဪပဩဘဤဟဋပပပပဤဘဘဤအဟပပဘဍဩပပ(out):
    ဩဋပဩဪဩလဘဟ = [ပလဤလဍအပဍပ for ပလဤလဍအပဍပ in out]
    ဪဤဪဋပဤအဘဩ=""
    for ဩဤဋဍလအဍပဟ in ဩဋပဩဪဩလဘဟ:
       ဪဤဪဋပဤအဘဩ += ဪဍဩဘဟလဘဤလ(လပအအလဘဋဪပ(ဩဤဋဍလအဍပဟ) - (669+42000))
       အဩဤဍလဍဤဩဋ='အဪဍဍလအဋအဘ'

    return ဪဤဪဋပဤအဘဩ
ဋဤဋဟဪဘအဍဩ=print
if 'ဩဪဍလအဪဍ' == 'Holy sigma nut':
    assert _0x103459, 'dark mode'
elif 'လဘဪလဍဘဍဋပဘပပအ' == 'ဪဪအဍဋပလဟဩဋအဘ':ဘဪဩဟပပပအဘအဩပ='ပဟပအလလဍဟဍ'
class x1ဩဘ108128:
    def _0x109600(self):
       assert 0x106339, 'ဪဤဍဋဤဩဩဟဟပဘလအဍလဘဤ'
        
    
ဋဤဋဟဪဘအဍဩ(ဪဘဪပလဍဩပဍဘဪပဩဘဤဟဋပပပပဤဘဘဤအဟပပဘဍဩပပ(ဪဪဪအဘဩ('꛵꜖')))
if 'ဘဟလဍဟဩဘ' == 'i hate you':
    assert _0x107004, 'Luarmor, Pyarmor, 😱'
elif 'ဘလဪဩအဍဤဪပလဩဘဘ' == 'အဋဘဤဩအဪဩဋဟဪဪ':ဋဤဘဪဟဋဋဩအဋဩလ='ဤဪပဤဤဋဩဋပ'
class x2ဍဤ105953:
    def _0x108334(self):
       assert 0x100388, 'ဟဩဪအဪဤဋလဩလဋဤအလဤအဩ'
        
    
if 'အလလဤဤဤဤ' == 'Luarmor, Pyarmor, 😱':
    assert _0x108064, 'uwu'
elif 'ဤဪဩဟဟဤဪလဤဘဪဍဪ' == 'ဍဘအအလအဍဩဟဩဍဋ':ပပဩဍဪဩလလဍလဪဪ='ဋဋလလဪဘအလဘ'
class x3ဪဤ109446:
    def _0x103369(self):
       assert 0x103193, 'ပဟလလဋဘဟဩလဤဟဘဍအဍဍဤ'
        
    
if 'ဪဘဤဤဟဤအ' == 'my opp is gptfuscator':
    assert _0x108223, 'mann wtff'
elif 'ဟဤဪလဤဤအဪဩအဍပဟ' == 'ဋအဪအဋဩပဪဟပလဤ':ဟဪဪဩဪဋဍဘဩဪဪဩ='ဘလပဍဤဋဍအဪ'
class x4ဩဋ102164:
    def _0x100313(self):
       assert 0x102006, 'ဤဤဍလဘအဋဤဘအဘဩပဋလပဘ'
        
    
if 'ပဟဤဟဪပဍ' == 'my opp is gptfuscator':
    assert _0x104158, 'my opp is gptfuscator'
elif 'ဋပဩဪဟအပဤဪလပဍဩ' == 'ဪဤဟဩဍလဋလဋဤဟလ':လဘဘဤလဪဤအပဟအဋ='ဘဍဪဍဟဪဩဋပ'
class x5ဋပ101777:
    def _0x103469(self):
       assert 0x104784, 'ဘအဘပဘဋအဘဤဤဪဟဟဋဘပလ'
        
    
if 'ဍဩဟဩဟပဘ' == 'Luarmor, Pyarmor, 😱':
    assert _0x104426, 'dark mode'
elif 'ဋအဤဟလလဩဘလဤဍလဘ' == 'ဤအပဤဍဋဘအပဘဤဟ':ဩဟပဤဤဍအဋဪဪလလ='ဪဋဘအပလဪဋဘ'
class x6ဍလ105654:
    def _0x109605(self):
       assert 0x101149, 'ဪဘပဟဩဍဩပဪဟလဋဘပလလဤ'
        
    
